{
    "relevance_title": "Бағдарламаның Өзектілігі",
    "relevance_p1":"Статистика көрсеткендей, Қазақстан Республикасында 2020 жылдан бастап І-технологияларды пайдалана отырып жасалатын анықталған және ашылған құқық бұзушылықтар саны едәуір артты.",
    "relevance_p2":"Цифрлық криминалистика цифрлық дәуірдегі киберқылмыспен күресуде маңызды рөл атқарады. ҚР уәкілетті мемлекеттік органдарының цифрлық криминалистика саласындағы мамандары ашу үшін қолжетімді заманауи техникалар мен құралдарды пайдаланады. Олардың жұмысы цифрлық әлемде қауіпсіздікті қамтамасыз етуге және қатысы бар адамдарды жауапкершілікке тартуға ықпал етеді. Қазақстандық әзірлеу киберқылмыс қатерлерімен тиімді күресу және қоғамдағы қауіпсіздікті онлайн-ортада қамтамасыз ету үшін отандық криминалистикалық саланы дамытуға және жетілдіруге серпін беруге мүмкіндік береді.",
    "relevance_p3":"Бұл жоба бүкіл әлемде және біздің елде киберқылмыстардың көбеюінің өсіп келе жатқан проблемасына арналған. Болашақта мобильді криминалистика бөлігінде Деректерді талдаудың жетілдірілген жүйесімен сатып алынған импорттық шешімдерге (аналогтарға) тәуелділіктің маңызды мәселесін шеше отырып, Цифрлық және мобильді криминалистика саласындағы отандық шешімді ұсынуға бағытталған. Ұсыныс цифрлық криминалистердің тергеуі барысында деректерді өңдеу уақытын оңтайландыру және шешім қабылдау алгоритмдерін жақсарту және ҚР құқықтық және азаматтық халқын қорғауды арттыру үшін жасанды интеллектті пайдалану арқылы осы мәселені шешуге бағытталған. Ұсынылған тәсіл қолданыстағы және жойылған ақпаратты қалпына келтірудің озық әдістерін біріктіреді, сонымен қатар тиімді шешім қабылдау үшін әр түрлі сценарийлерде мұқият тексерілген жасанды интеллект көмегімен алынған деректерді талдауды оңтайландырады. Жоба Цифрлық криминалистика саласындағы зерттеулер деңгейін арттыруға, жоғары технологиялық шешімдерді әзірлеуге және университет рейтингін арттыруға және әлемнің бірқатар ТОП елдеріндегі мемлекет ретінде \"Қазақстанның 2050 ПАЙЫМЫ\" бағдарламасымен келісуге ықпал ете отырып, ақпараттық қауіпсіздік және цифрлық форензика жөніндегі мамандардың мемлекеттік деңгейдегі өнімділік көрсеткіштерін айтарлықтай жақсартуды көздейді.",
    "goal_title": "Бағдарламаның мақсаты",
    "goal_p1": "Бағдарламаның мақсаты – интеллектуалды бағдарламалық-аппараттық кешендерді қолдана отырып, цифрлық криминалистикалық зерттеулер жүргізудің инновациялық технологияларын әзірлеу.",
    "goal_p2": "Жоба мобильді бағдарламалық-аппараттық кешендерді әзірлеуге бағытталған, атап айтқанда: микросхеманың физикалық тұтастығы сақталған жағдайда істен шыққан мобильді құрылғылардан, қатты дискілерден және қатты күйдегі ақпарат тасымалдағыштарынан деректерді шығару, қалпына келтіру және талдау; деректер қайта жазылмаған жағдайда бейнежазба құрылғыларының әртүрлі файлдық жүйелерінен жойылған бейнежазбаларды қалпына келтіру; цифрлық криминалистика саласында деректерді терең талдау үшін жасанды интеллектті қолдану. Жоба аясында цифрлық криминалистика үшін ақпаратты шығаруға арналған, жаңа әдістермен әзірленген бағдарламалық жасақтамамен жабдықталған, тасымалданатын екі түрлі мобильді аппараттың прототипі жасалады.",
    "results_title": "Бағдарламаның күтілетін нәтижелері",
    "results_intro": "Бағдарламаның нәтижесінде келесі тікелей нәтижелерге қол жеткізілуі тиіс:",
    "result_1": "Шетелдік және отандық тәжірибені зерттеу және талдау: цифрлық криминалистика және кибероқиғаларды тергеу саласындағы заманауи жетістіктер, технологиялар мен әдістемелер;",
    "result_2": "Деректердің интеллектуалды талдауы: бірегей идентификаторлар негізінде екі және одан да көп пайдаланушылардың өзара әрекетін анықтау мақсатында әртүрлі операциялық жүйелерден алынған деректерді талдау;",
    "result_3": "Деректерді шығару және қалпына келтіру әдістері: әртүрлі файлдық жүйелерден бар деректерді шығару және жойылған деректерді қалпына келтіру, сондай-ақ қалпына келтірілген файлдарды тұтастығы мен шифрлаудың болмауы бойынша автоматты түрде жіктеу әдістері;",
    "result_4": "Істен шыққан құрылғылардан ақпарат шығару әдістері: микросхеманың физикалық тұтастығы сақталған жағдайда мобильді құрылғылардан, қатты дискілерден және қатты күйдегі ақпарат тасымалдағыштардан ақпарат шығару;",
    "result_5": "Бейнежазбаларды қалпына келтіру әдістері: деректер қайта жазылмаған жағдайда бейнежазба құрылғыларының әртүрлі файлдық жүйелерінен бар және жойылған бейнежазбаларды шығару және қалпына келтіру;",
    "result_6": "Жүйенің тәжірибелік үлгісі: әртүрлі операциялық жүйелерден деректерді интеллектуалды талдауға, әртүрлі файлдық жүйелерден бар және жойылған деректерді шығару және қалпына келтіруге, істен шыққан мобильді құрылғылардан ақпарат шығару және бейнежазба құрылғыларының файлдық жүйелерінен жойылған бейнежазбаларды қалпына келтіруге арналған кешеннің тәжірибелік үлгісі;",
    "result_7": "Техникалық және әдістемелік құжаттама: жүйенің тәжірибелік үлгісін жасау аясында әзірленген барлық құжаттама.",
    "publications_intro": "Бағдарлама нәтижелері бойынша мыналар жарияланады:",
    "pub_1": "Бағдарламаның ғылыми бағыты бойынша рецензияланатын ғылыми басылымдарда кемінде 3 (үш) мақала және (немесе) шолу, олар Web of Science деректер базасында импакт-фактор бойынша 1 (бірінші), 2 (екінші) және (немесе) 3 (үшінші) квартильге енеді және (немесе) Scopus деректер базасында CiteScore бойынша кемінде 50 (елу) процентильге ие.",
    "pub_2": "КОКСОН (ҚР БҒМ Ғылым және жоғары білім комитеті) ұсынған журналдарда кемінде 5 (бес) мақала.",
    "pub_3": "Өтініш беруші ұйымның Ғылыми кеңесі және (немесе) ғылыми-техникалық кеңесі ұсынған шетелдік және (немесе) қазақстандық баспаларда жарияланған кемінде 1 (бір) монография немесе оқу құралы.",
    "pub_4": "Қазақстан Республикасының Ұлттық зияткерлік меншік институтында тіркелген кемінде 2 (екі) зияткерлік меншік нысаны (патент; ақпараттық технологиялар саласындағы өтінімдер үшін – авторлық куәлік).",
    "final_title": "Қорытынды нәтиже",
    "effect_tech_title": "Ғылыми-техникалық әсері",
    "effect_tech_p": "Ғылыми-техникалық бағдарламаны жүзеге асыру нәтижесінде интеллектуалды бағдарламалық-аппараттық кешендерді қолдана отырып, цифрлық криминалистикалық зерттеулерді жүргізудің инновациялық технологиялары пайда болуы тиіс.",
    "effect_science_title": "Ғылыми әсері",
    "effect_science_p": "Цифрлық криминалистикалық зерттеулерді жүргізудің инновациялық технологияларын жасау мен практикалық апробациялауда және олардың тиімділігін арттыруда көрініс табады.",
    "effect_economic_title": "Экономикалық әсері",
    "effect_economic_p": "Аталған ғылыми-техникалық тапсырманы орындау киберқауіпсіздік саласының дамуына, киберқауіпсіздікті қамтамасыз етуге қойылатын талаптардың кеңеюі мен жаңара түсуіне, сондай-ақ цифрлық криминалистика техникалық құралдарының арсеналының ұлғаюына негізделген.",
    "effect_social_title": "Әлеуметтік әсері",
    "effect_social_p": "Бағдарлама нәтижесінде жеке тұлға, қоғам, киберкеңістік пен мемлекетті терроризм, экстремизм, шетелдік ұйымдардың деструктивті әрекеттері және ұлттық қауіпсіздікке басқа да қауіп-қатерлерден қорғау деңгейінің артуында көрінуі тиіс; кейіннен ғылыми-техникалық жетістіктердің әртүрлі үдерістерге енгізілуіне ықпал етіп, ғылым мен білім беру процестеріне инновациялық көзқарастарды дамытуға септігін тигізеді.",
    "impact_title": "Күтілетін нәтижелердің ғылым мен технология дамуына ықпалы",
    "impact_p1": "Жобаның негізгі артықшылығы – деректерді алу, қалпына келтіру және талдау үдерістерін жасанды интеллект әдістерін пайдалана отырып оңтайландыруға бағытталған пәнаралық тәсіл; бұл шешім компьютерлік криминалистика әдістерін зерттеуде ғылыми ізденістерді жандандырып, машиналық оқыту, терең оқыту және нейрожелілік технологияларды қолданатын көптеген әрі қарайғы зерттеулердің негізін құрайды.",
    "impact_p2": "Әдістер мен алгоритмдерді апробациялау және енгізу нәтижесінде республикалық және халықаралық журналдарда бірнеше ғылыми мақалалар жарияланып, конференциялар, симпозиумдар мен шебер сыныптарда таныстырылады; олардың мазмұны ақпараттық қауіпсіздік пен ақпараттық технологиялар саласындағы басқа да зерттеулерге негіз болады.",
    "collab_title": "Халықаралық әріптестік және патенттік құқық",
    "collab_p1": "Аталмыш зерттеу жобасы шеңберінде кем дегенде бір–екі халықаралық ғылыми зерттеу топтарымен, ықтимал серіктестер ретінде цифрлық криминалистика мен криптоанализ мәселелерімен айналысатын ұйымдармен ынтымақтастық жоспарлануда.",
    "patent_1": "Видеорегистратор файлдық жүйесінен сақталған және жойылған файлдарды алу мен қалпына келтіру әдісі;",
    "patent_2": "Чип бүтіндігін ескере отырып, ақаулы ұялы құрылғыдан деректер алу әдісі;",
    "patent_3": "Құрылғының аналық тақтасынан деректер алу әдісі.",
    "collab_p2": "Сонымен қатар, барлық аталған әдістерді іске асыратын бағдарламалық өнімдер мен аппарат-бағдарламалық кешеннің авторлық құқықтары тіркеліп, зияткерлік меншік құқықтары рәсімделеді.",
    "table_title": "Күнтізбелік жоспарға сәйкес іс-шаралардың орындалуын бақылау",
    "table_columns": [
        "№",
        "Күнтізбелік жоспар бойынша іс-шаралар",
        "Орындау мерзімдері",
        "Күнтізбелік жоспар пункттерінің іс-шараларының нақты орындалуы"
    ],
    "table_rows": [
        {
            "num": "1",
            "activity": "Бейне тіркегіштердің файлдық жүйелерін шифрлау әдістеріне талдау жүргізу",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Бейне тіркегіштердің файлдық жүйелерін шифрлау әдістеріне талдау жүргізілді.\nТалдау нәтижелері бар есептер, жүйеге қойылатын талаптарды нақтылау үшін аналитикалық мәліметтер жазылды."
        },
        {
            "num": "2",
            "activity": "Мобильді құрылғылардың файлдық жүйелерін шифрлау әдістеріне талдау жүргізу",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Мобильді құрылғылардың файлдық жүйелерін шифрлау әдістеріне талдау жүргізілді.\nТалдау нәтижелері бар есептер, жүйеге қойылатын талаптарды нақтылау үшін аналитикалық мәліметтер жазылды."
        },
        {
            "num": "3",
            "activity": "Түрлі файлдық жүйелерден бар деректерді шығару және жойылған деректерді қалпына келтіру әдістерін әзірлеу, сондай-ақ қалпына келтірілген файлдарды тұтастығы мен шифрлаудың болмауы бойынша автоматты түрде жіктеу үшін криминалистикалық талдауға арналған әдістерді әзірлеу",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Диск бөлімдерін және файлдық жүйені анықтау, деректер шифрлаудың бар-жоғын іздеу және белгілі пароль болған жағдайда дешифрлау әдістері әзірленді, оның ішінде:\n• мобильді телефондардың шикі диск образының бөлімдері мен ФЖ анықтау;\n• мобильді телефондардың шикі диск образы бөлімдерінің шифрлануын іздеу;\n• белгілі пароль болған жағдайда мобильді телефондардың шикі диск образы деректерін дешифрлау;\n• SSD және HDD шикі диск образының бөлімдері мен ФЖ анықтау;\n• SSD және HDD шикі диск образы бөлімдерінің шифрлануын іздеу."
        },
        {
            "num": "4",
            "activity": "Чиптің физикалық тұтастығы сақталған жағдайда істен шыққан мобильді құрылғылардан, қатты дискілерден және қатты күйдегі жинақтауыштардан ақпарат шығару әдістерін әзірлеу",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Магниттік тасымалдаушының тұтастығы және ОС шифрлауы болмаған жағдайда HDD-дан ақпарат шығару әдістері зерттелді. ҒЗТЖ есебі жазылды.\nNAND контроллері мен жад чиптерінің тұтастығы және ОС шифрлауы болмаған жағдайда SSD-дан ақпарат шығару әдістері зерттелді. ҒЗТЖ есебі жазылды."
        },
        {
            "num": "5",
            "activity": "Деректерді типтер бойынша сұрыптау және қалталарға орналастыру әдісін әзірлеу (фото, бейне, аудио, құжаттар, контактілер, геолокация, чаттар тарихы, жүктеулер тарихы)",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Деректерді типтер мен қалталар бойынша сұрыптаудың отандық және шетелдік шешімдеріне талдау жүргізілді.\nЖИ қолданатын сұрыптау әдісі және файлдардың ерекшеліктерін ескере отырып, қалталар бойынша автоматты топтастыру әдісі әзірленді."
        },
        {
            "num": "6",
            "activity": "Түрлі құрылғыларда ұқсастықты іздеу бойынша талдау әдістері",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Файлдар типтерін тақырып және мазмұн бойынша талдау әдісі, сондай-ақ SIM-карта деректерін талдау әдісі әзірленді.\nМедиафайлдарда бейнелерді тану және дауыстарды идентификациялау, оларды сәйкестендіру және ұқсастықты іздеу әдісі әзірленді."
        },
        {
            "num": "7",
            "activity": "Талдау модульдері: сұрау (форматқа байланысты)",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Түрлі форматтарда негізгі критерийлер бойынша іздеу әдістері әзірленді:\n1. фотодағы мәтінді, объектілерді, тұлғаларды тану;\n2. сурет бойынша іздеу;\n3. сөйлеуді транскрипциялау, негізгі сөздер бойынша іздеу, дауыс арқылы идентификация;\n4. контактілер бойынша іздеу;\n5. қозғалыс траекториясын құру;\n6. хат алмасуды сұрыптау және сүзу, ұқсас суреттерді іздеу;\n7. сілтемелер мен атауларды іздеу, топты анықтау."
        },
        {
            "num": "8",
            "activity": "Есепті автоматты түрде генерациялау – БҚ модулі",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "АПК барлық модульдерінің нәтижелерімен мәтіндік есепті автоматты түрде генерациялайтын БҚ модулі әзірленді."
        },
        {
            "num": "9",
            "activity": "Құжаттың бірегей хеш-суммасын анықтауға арналған БҚ модулін әзірлеу",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Файлдың бірегей хеш-суммасын анықтауға арналған БҚ модулі әзірленді."
        },
        {
            "num": "10",
            "activity": "Екі түрлі аппараттық кешенді әзірлеу",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Аналогтарға талдау жүргізілді, АПК-нің техникалық және физикалық қасиеттері келістірілді, жабдық сатып алынды."
        },
        {
            "num": "11",
            "activity": "БҚ архитектурасы",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "Техникалық тапсырмаға сәйкес БҚ архитектурасы жобаланды және тапсырыс берушімен бекітілді."
        },
        {
            "num": "12",
            "activity": "CTF жарыстарын өткізу",
            "dates": "2024 жылдың 1 қыркүйегі - 1 желтоқсаны",
            "actual": "2024 жылдың 24 қарашасында техникалық мамандықтардың студенттері үшін CTF жарысы өткізілді."
        },
        {
            "num": "13",
            "activity": "Түрлі ФЖ-дан деректерді шығару және қалпына келтіру әдістерін әзірлеу",
            "dates": "2025 жылдың 5 қаңтары - 1 қарашасы",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр."
        },
        {
            "num": "14",
            "activity": "Чиптің тұтастығы сақталған жағдайда істен шыққан құрылғылардан ақпарат шығару әдістерін әзірлеу",
            "dates": "2025 жылдың 5 қаңтары - 1 қарашасы",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр."
        },
        {
            "num": "15",
            "activity": "Бейне тіркегіштердің ФЖ-дан жойылған бейнежазбаларды қайта жазусыз қалпына келтіру әдістерін әзірлеу",
            "dates": "2025 жылдың 1 маусымы - 1 қарашасы",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр."
        },
        {
            "num": "16",
            "activity": "Түрлі құрылғыларда ұқсастықты іздеу бойынша талдау әдістері",
            "dates": "2025 жылдың 5 қаңтары - 1 қарашасы",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр."
        },
        {
            "num": "17",
            "activity": "Талдау модульдері: сұрау (форматқа байланысты)",
            "dates": "2025 жылдың 5 қаңтары - 1 қарашасы",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр."
        },
        {
            "num": "18",
            "activity": "Екі түрлі аппараттық кешенді әзірлеу",
            "dates": "2025 жылдың 5 қаңтары - қыркүйек",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр."
        },
        {
            "num": "19",
            "activity": "Бастапқы кодтың блок-схемасы",
            "dates": "2025 жылдың қарашасы",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр."
        },
        {
            "num": "20",
            "activity": "Публикация дайындау",
            "dates": "2025 жылдың шілдесі - 1 қарашасы",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр.\n2 мақала жарияланды:\n1) Rzayeva L. et al., «Хат алмасуды талдау сервисінің әзірленуі…», IJICT, 2025.\n2) Leila Rzayeva et al., «Техникалық ерекшеліктерді талдау…», AITU ғылыми журналы.\nКОКНВО журналдарында 4 мақала жариялауға қабылданды.\nSNPD-2025, CSP2025, ISDFS 2025 халықаралық конференцияларына 6 мақала жіберілді."
        },
        {
            "num": "21",
            "activity": "Тапсырыс берушінің сұрауы бойынша пайдаланушы интерфейсін әзірлеу",
            "dates": "2025 жылдың шілдесі - 1 қарашасы",
            "actual": "Жұмыстарды орындау процесі жүріп жатыр."
        },
        {
            "num": "22",
            "activity": "CTF жарыстарын өткізу",
            "dates": "2025 жылдың 5 қаңтары - 1 қарашасы",
            "actual": "AITU базасында 2025 жылдың 29-30 сәуірінде ICCSDFAI25 конференциясы аясында екі іс-шара."
        }
    ],
    "table_conclusion": "Қорытынды: Жүргізілген іс-шаралардың сәйкестігі, қойылған мақсаттар мен міндеттерге қол жеткізу дәрежесі, қол жеткізілген нәтижелердің күнтізбелік жоспарға және шарттардың техникалық сипаттамасына сәйкестігі"
}