{
    "goal_title": "Бағдарламаның мақсаты",
    "goal_p1": "Бағдарламаның мақсаты – интеллектуалды бағдарламалық-аппараттық кешендерді қолдана отырып, цифрлық криминалистикалық зерттеулер жүргізудің инновациялық технологияларын әзірлеу.",
    "goal_p2": "Жоба мобильді бағдарламалық-аппараттық кешендерді әзірлеуге бағытталған, атап айтқанда: микросхеманың физикалық тұтастығы сақталған жағдайда істен шыққан мобильді құрылғылардан, қатты дискілерден және қатты күйдегі ақпарат тасымалдағыштарынан деректерді шығару, қалпына келтіру және талдау; деректер қайта жазылмаған жағдайда бейнежазба құрылғыларының әртүрлі файлдық жүйелерінен жойылған бейнежазбаларды қалпына келтіру; цифрлық криминалистика саласында деректерді терең талдау үшін жасанды интеллектті қолдану. Жоба аясында цифрлық криминалистика үшін ақпаратты шығаруға арналған, жаңа әдістермен әзірленген бағдарламалық жасақтамамен жабдықталған, тасымалданатын екі түрлі мобильді аппараттың прототипі жасалады.",
    "results_title": "Бағдарламаның күтілетін нәтижелері",
    "results_intro": "Бағдарламаның нәтижесінде келесі тікелей нәтижелерге қол жеткізілуі тиіс:",
    "result_1": "Шетелдік және отандық тәжірибені зерттеу және талдау: цифрлық криминалистика және кибероқиғаларды тергеу саласындағы заманауи жетістіктер, технологиялар мен әдістемелер;",
    "result_2": "Деректердің интеллектуалды талдауы: бірегей идентификаторлар негізінде екі және одан да көп пайдаланушылардың өзара әрекетін анықтау мақсатында әртүрлі операциялық жүйелерден алынған деректерді талдау;",
    "result_3": "Деректерді шығару және қалпына келтіру әдістері: әртүрлі файлдық жүйелерден бар деректерді шығару және жойылған деректерді қалпына келтіру, сондай-ақ қалпына келтірілген файлдарды тұтастығы мен шифрлаудың болмауы бойынша автоматты түрде жіктеу әдістері;",
    "result_4": "Істен шыққан құрылғылардан ақпарат шығару әдістері: микросхеманың физикалық тұтастығы сақталған жағдайда мобильді құрылғылардан, қатты дискілерден және қатты күйдегі ақпарат тасымалдағыштардан ақпарат шығару;",
    "result_5": "Бейнежазбаларды қалпына келтіру әдістері: деректер қайта жазылмаған жағдайда бейнежазба құрылғыларының әртүрлі файлдық жүйелерінен бар және жойылған бейнежазбаларды шығару және қалпына келтіру;",
    "result_6": "Жүйенің тәжірибелік үлгісі: әртүрлі операциялық жүйелерден деректерді интеллектуалды талдауға, әртүрлі файлдық жүйелерден бар және жойылған деректерді шығару және қалпына келтіруге, істен шыққан мобильді құрылғылардан ақпарат шығару және бейнежазба құрылғыларының файлдық жүйелерінен жойылған бейнежазбаларды қалпына келтіруге арналған кешеннің тәжірибелік үлгісі;",
    "result_7": "Техникалық және әдістемелік құжаттама: жүйенің тәжірибелік үлгісін жасау аясында әзірленген барлық құжаттама.",
    "publications_intro": "Бағдарлама нәтижелері бойынша мыналар жарияланады:",
    "pub_1": "Бағдарламаның ғылыми бағыты бойынша рецензияланатын ғылыми басылымдарда кемінде 3 (үш) мақала және (немесе) шолу, олар Web of Science деректер базасында импакт-фактор бойынша 1 (бірінші), 2 (екінші) және (немесе) 3 (үшінші) квартильге енеді және (немесе) Scopus деректер базасында CiteScore бойынша кемінде 50 (елу) процентильге ие.",
    "pub_2": "КОКСОН (ҚР БҒМ Ғылым және жоғары білім комитеті) ұсынған журналдарда кемінде 5 (бес) мақала.",
    "pub_3": "Өтініш беруші ұйымның Ғылыми кеңесі және (немесе) ғылыми-техникалық кеңесі ұсынған шетелдік және (немесе) қазақстандық баспаларда жарияланған кемінде 1 (бір) монография немесе оқу құралы.",
    "pub_4": "Қазақстан Республикасының Ұлттық зияткерлік меншік институтында тіркелген кемінде 2 (екі) зияткерлік меншік нысаны (патент; ақпараттық технологиялар саласындағы өтінімдер үшін – авторлық куәлік).",
    "final_title": "Қорытынды нәтиже",
    "effect_tech_title": "Ғылыми-техникалық әсері",
    "effect_tech_p": "Ғылыми-техникалық бағдарламаны жүзеге асыру нәтижесінде интеллектуалды бағдарламалық-аппараттық кешендерді қолдана отырып, цифрлық криминалистикалық зерттеулерді жүргізудің инновациялық технологиялары пайда болуы тиіс.",
    "effect_science_title": "Ғылыми әсері",
    "effect_science_p": "Цифрлық криминалистикалық зерттеулерді жүргізудің инновациялық технологияларын жасау мен практикалық апробациялауда және олардың тиімділігін арттыруда көрініс табады.",
    "effect_economic_title": "Экономикалық әсері",
    "effect_economic_p": "Аталған ғылыми-техникалық тапсырманы орындау киберқауіпсіздік саласының дамуына, киберқауіпсіздікті қамтамасыз етуге қойылатын талаптардың кеңеюі мен жаңара түсуіне, сондай-ақ цифрлық криминалистика техникалық құралдарының арсеналының ұлғаюына негізделген.",
    "effect_social_title": "Әлеуметтік әсері",
    "effect_social_p": "Бағдарлама нәтижесінде жеке тұлға, қоғам, киберкеңістік пен мемлекетті терроризм, экстремизм, шетелдік ұйымдардың деструктивті әрекеттері және ұлттық қауіпсіздікке басқа да қауіп-қатерлерден қорғау деңгейінің артуында көрінуі тиіс; кейіннен ғылыми-техникалық жетістіктердің әртүрлі үдерістерге енгізілуіне ықпал етіп, ғылым мен білім беру процестеріне инновациялық көзқарастарды дамытуға септігін тигізеді.",
    "impact_title": "Күтілетін нәтижелердің ғылым мен технология дамуына ықпалы",
    "impact_p1": "Жобаның негізгі артықшылығы – деректерді алу, қалпына келтіру және талдау үдерістерін жасанды интеллект әдістерін пайдалана отырып оңтайландыруға бағытталған пәнаралық тәсіл; бұл шешім компьютерлік криминалистика әдістерін зерттеуде ғылыми ізденістерді жандандырып, машиналық оқыту, терең оқыту және нейрожелілік технологияларды қолданатын көптеген әрі қарайғы зерттеулердің негізін құрайды.",
    "impact_p2": "Әдістер мен алгоритмдерді апробациялау және енгізу нәтижесінде республикалық және халықаралық журналдарда бірнеше ғылыми мақалалар жарияланып, конференциялар, симпозиумдар мен шебер сыныптарда таныстырылады; олардың мазмұны ақпараттық қауіпсіздік пен ақпараттық технологиялар саласындағы басқа да зерттеулерге негіз болады.",
    "collab_title": "Халықаралық әріптестік және патенттік құқық",
    "collab_p1": "Аталмыш зерттеу жобасы шеңберінде кем дегенде бір–екі халықаралық ғылыми зерттеу топтарымен, ықтимал серіктестер ретінде цифрлық криминалистика мен криптоанализ мәселелерімен айналысатын ұйымдармен ынтымақтастық жоспарлануда.",
    "patent_1": "Видеорегистратор файлдық жүйесінен сақталған және жойылған файлдарды алу мен қалпына келтіру әдісі;",
    "patent_2": "Чип бүтіндігін ескере отырып, ақаулы ұялы құрылғыдан деректер алу әдісі;",
    "patent_3": "Құрылғының аналық тақтасынан деректер алу әдісі.",
    "collab_p2": "Сонымен қатар, барлық аталған әдістерді іске асыратын бағдарламалық өнімдер мен аппарат-бағдарламалық кешеннің авторлық құқықтары тіркеліп, зияткерлік меншік құқықтары рәсімделеді."
}