{
    "goal_title": "Цель программы",
    "goal_p1": "Цель программы заключается в разработке инновационных технологий проведения цифровых криминалистических исследований с применением интеллектуальных программно-аппаратных комплексов.",
    "goal_p2": "Проект направлен на разработку мобильных программно-аппаратных комплексов для извлечения, восстановления и анализа данных из неисправных мобильных устройств, жёстких дисков и твердотельных накопителей при условии физической целостности чипа, а также на восстановление удалённых видеозаписей из различных файловых систем видеорегистраторов при условии отсутствия перезаписи данных, с применением искусственного интеллекта для последующего глубокого анализа. Будут созданы два типа переносных цифрово-криминалистических аппаратов с новыми методами в рамках проекта.",
    "results_title": "Ожидаемые результаты программы",
    "results_intro": "По результатам программы должны быть получены следующие прямые результаты:",
    "result_1": "Исследование и анализ зарубежного и отечественного опыта: современных достижений, технологий и методик в области цифровой криминалистики и расследования киберинцидентов;",
    "result_2": "Интеллектуальный анализ данных из различных операционных систем на предмет выявления взаимодействия двух и более пользователей на основе уникальных идентификаторов;",
    "result_3": "Методы извлечения и восстановления удалённых данных из разных файловых систем, а также автоматическая классификация файлов по целостности и шифрованию для дальнейшего анализа;",
    "result_4": "Методы извлечения информации из неисправных мобильных устройств, жёстких дисков и SSD при сохранности чипа;",
    "result_5": "Методы восстановления удалённых видеозаписей из файловых систем видеорегистраторов при отсутствии перезаписи данных;",
    "result_6": "Опытный образец системы для интеллектуального анализа и восстановления данных из разных источников;",
    "result_7": "Техническая и методическая документация по созданию опытного образца системы.",
    "publications_intro": "По результатам программы опубликованы:",
    "pub_1": "не менее 3 (три) статей и (или) обзоров в рецензируемых научных изданиях по научному направлению программы, входящих в 1 (первый), 2 (второй) и (или) 3 (третий) квартиль по импакт-фактору в базе данных Web of Science и (или) имеющих процентиль по CiteScore в базе данных Scopus не менее 50 (пятидесяти).",
    "pub_2": "не менее 5 (пяти) статей в журналах, рекомендованных КОКНВО",
    "pub_3": "не менее 1 (одной) монографии или учебных пособии в зарубежных и (или) казахстанских издательств, рекомендованных ученым советом и (или) научно-техническим советом организации заявителя",
    "pub_4": "не менее 2 (двух) объекта интеллектуальной собственности (патент; для заявок в области информационных технологий - авторское свидетельство), зарегистрированных в Национальном Институте интеллектуальной собственности Республики Казахстан",
    "final_title": "Конечный результат",
    "effect_tech_title": "Научно-технический эффект",
    "effect_tech_p": "В результате реализации программы появятся инновационные технологии цифровых криминалистических исследований с применением интеллектуальных комплексов.",
    "effect_science_title": "Научный эффект",
    "effect_science_p": "Выражается в создании и практической апробации новых методов и повышении эффективности их применения.",
    "effect_economic_title": "Экономический эффект",
    "effect_economic_p": "Обусловлен развитием кибербезопасности, появлением новых требований и расширением арсенала технических средств цифровой криминалистики.",
    "effect_social_title": "Социальный эффект",
    "effect_social_p": "Повышение защищённости личности, общества и государства от киберугроз, а также внедрение научно-технических достижений в образовательный процесс и практику.",
    "impact_title": "Влияние на развитие смежных областей",
    "impact_p1": "Ключевым преимуществом проекта является междисциплинарный подход и применение искусственного интеллекта, что способствует развитию методов компьютерной криминалистики и станет основой для дальнейших исследований в области ИИ и нейросетевых технологий.",
    "impact_p2": "По результатам апробации будут опубликованы научные труды и представлены доклады на конференциях и мастер-классах. В проекте планируется провести CTF для студентов и вовлечь магистрантов и докторантов казахстанских вузов для формирования школы цифровой криминалистики.",
    "collab_title": "Сотрудничество и патентная деятельность",
    "collab_p1": "Планируется сотрудничество с международными исследовательскими группами по цифровой криминалистике и криптоанализу. По итогам будут оформлены патенты в НИИИС РК на следующие методы:",
    "patent_1": "Извлечение и восстановление удалённых файлов из файловых систем видеорегистраторов;",
    "patent_2": "Извлечение данных из неисправных мобильных устройств при целостности чипа;",
    "patent_3": "Извлечение данных с материнской платы устройства.",
    "collab_p2": "Права на разработанные ПО и аппаратно-программный комплекс будут оформлены как объекты интеллектуальной собственности."
}