{
    "relevance_title":"Актуальность Программы",
    "relevance_p1":"Статистика показывает, что в Республике Казахстан с 2020 года значительно увеличилось количество выявленных и раскрытых правонарушений, совершаемых с использованием ІТ-технологий.",
    "relevance_p2":"Цифровая криминалистика играет важную роль в борьбе с киберпреступностью в цифровую эпоху. Специалисты уполномоченных государственных органов РК в сфере цифровой криминалистики используют доступные современные техники и инструменты для раскрытия. Их работа способствует обеспечению безопасности в цифровом мире и привлечению к ответственности причастных лиц. Казахстанская разработка позволит придать импульс развитию и совершенствованию отечественной криминалистической отрасли, чтобы эффективно бороться с угрозами киберпреступности и обеспечивать безопасность в общества онлайн-среде.",
    "relevance_p3":"Этот проект посвящен растущей проблеме увеличения киберпреступлений по всему миру и в нашей стране, в частности. Сфокусированный на предоставлении отечественного решения в области цифровой и мобильной криминалистики, решая в перспективе критический вопрос зависимости от закупленных импортных решений (аналогов) с улучшенной системой анализа данных в части мобильной криминалистике. Предложение направлено на решение этой проблемы путем использования искусственного интеллекта для оптимизации времени на обработку данных в ходе следствия цифровых криминалистов и улучшения алгоритмов принятия решений и повышению защиты правового и гражданского населения РК. Предложенный подход объединяет передовые методы извлечения существующей и восстановления удаленной информации, а также оптимизации анализа полученных данных с применением искусственного интеллекта, тщательно протестированные в различных возможных сценариях для эффективного принятия последующих решений. Проект предполагает значительное улучшение показателей производительности специалистов по информационной безопасности и цифровой форензике на государственном уровне, способствуя повышению уровня исследований в области цифровой криминалистики, разработке высокотехнологичных решений и повышению рейтинга университета, и согласованию с программой \"Видение Казахстана 2050\" как государства в ряде ТОП стран мира.",
    "goal_title": "Цель программы",
    "goal_p1": "Цель программы заключается в разработке инновационных технологий проведения цифровых криминалистических исследований с применением интеллектуальных программно-аппаратных комплексов.",
    "goal_p2": "Проект направлен на разработку мобильных программно-аппаратных комплексов для извлечения, восстановления и анализа данных из неисправных мобильных устройств, жёстких дисков и твердотельных накопителей при условии физической целостности чипа, а также на восстановление удалённых видеозаписей из различных файловых систем видеорегистраторов при условии отсутствия перезаписи данных, с применением искусственного интеллекта для последующего глубокого анализа. Будут созданы два типа переносных цифрово-криминалистических аппаратов с новыми методами в рамках проекта.",
    "results_title": "Ожидаемые результаты программы",
    "results_intro": "По результатам программы должны быть получены следующие прямые результаты:",
    "result_1": "Исследование и анализ зарубежного и отечественного опыта: современных достижений, технологий и методик в области цифровой криминалистики и расследования киберинцидентов;",
    "result_2": "Интеллектуальный анализ данных из различных операционных систем на предмет выявления взаимодействия двух и более пользователей на основе уникальных идентификаторов;",
    "result_3": "Методы извлечения и восстановления удалённых данных из разных файловых систем, а также автоматическая классификация файлов по целостности и шифрованию для дальнейшего анализа;",
    "result_4": "Методы извлечения информации из неисправных мобильных устройств, жёстких дисков и SSD при сохранности чипа;",
    "result_5": "Методы восстановления удалённых видеозаписей из файловых систем видеорегистраторов при отсутствии перезаписи данных;",
    "result_6": "Опытный образец системы для интеллектуального анализа и восстановления данных из разных источников;",
    "result_7": "Техническая и методическая документация по созданию опытного образца системы.",
    "publications_intro": "По результатам программы опубликованы:",
    "pub_1": "не менее 3 (три) статей и (или) обзоров в рецензируемых научных изданиях по научному направлению программы, входящих в 1 (первый), 2 (второй) и (или) 3 (третий) квартиль по импакт-фактору в базе данных Web of Science и (или) имеющих процентиль по CiteScore в базе данных Scopus не менее 50 (пятидесяти).",
    "pub_2": "не менее 5 (пяти) статей в журналах, рекомендованных КОКНВО",
    "pub_3": "не менее 1 (одной) монографии или учебных пособии в зарубежных и (или) казахстанских издательств, рекомендованных ученым советом и (или) научно-техническим советом организации заявителя",
    "pub_4": "не менее 2 (двух) объекта интеллектуальной собственности (патент; для заявок в области информационных технологий - авторское свидетельство), зарегистрированных в Национальном Институте интеллектуальной собственности Республики Казахстан",
    "final_title": "Конечный результат",
    "effect_tech_title": "Научно-технический эффект",
    "effect_tech_p": "В результате реализации программы появятся инновационные технологии цифровых криминалистических исследований с применением интеллектуальных комплексов.",
    "effect_science_title": "Научный эффект",
    "effect_science_p": "Выражается в создании и практической апробации новых методов и повышении эффективности их применения.",
    "effect_economic_title": "Экономический эффект",
    "effect_economic_p": "Обусловлен развитием кибербезопасности, появлением новых требований и расширением арсенала технических средств цифровой криминалистики.",
    "effect_social_title": "Социальный эффект",
    "effect_social_p": "Повышение защищённости личности, общества и государства от киберугроз, а также внедрение научно-технических достижений в образовательный процесс и практику.",
    "impact_title": "Влияние на развитие смежных областей",
    "impact_p1": "Ключевым преимуществом проекта является междисциплинарный подход и применение искусственного интеллекта, что способствует развитию методов компьютерной криминалистики и станет основой для дальнейших исследований в области ИИ и нейросетевых технологий.",
    "impact_p2": "По результатам апробации будут опубликованы научные труды и представлены доклады на конференциях и мастер-классах. В проекте планируется провести CTF для студентов и вовлечь магистрантов и докторантов казахстанских вузов для формирования школы цифровой криминалистики.",
    "collab_title": "Сотрудничество и патентная деятельность",
    "collab_p1": "Планируется сотрудничество с международными исследовательскими группами по цифровой криминалистике и криптоанализу. По итогам будут оформлены патенты в НИИИС РК на следующие методы:",
    "patent_1": "Извлечение и восстановление удалённых файлов из файловых систем видеорегистраторов;",
    "patent_2": "Извлечение данных из неисправных мобильных устройств при целостности чипа;",
    "patent_3": "Извлечение данных с материнской платы устройства.",
    "collab_p2": "Права на разработанные ПО и аппаратно-программный комплекс будут оформлены как объекты интеллектуальной собственности.",
    "table_title": "Мониторинг исполнения мероприятий согласно календарному плану",
    "table_columns": [
        "№",
        "Мероприятия по календарному плану",
        "Сроки исполнения",
        "Фактическое исполнение мероприятий пунктов календарного плана"
    ],
    "table_rows": [
        {
            "num": "1",
            "activity": "Проведение анализа методов шифрования файловых систем видеорегистраторов",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Выполнен анализ методов шифрования файловых систем видеорегистраторов.\nОтчеты с результатами анализа, аналитические сведения для уточнения требований к системе написаны."
        },
        {
            "num": "2",
            "activity": "Проведение анализа методов шифрования файловых систем мобильных устройств",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Выполнен анализ методов шифрования файловых систем мобильных устройств.\nОтчеты с результатами анализа, аналитические сведения для уточнения требований к системе написаны."
        },
        {
            "num": "3",
            "activity": "Разработать методы извлечения существующих и восстановление удаленных данных из различных файловых систем, а также автоматическая классификация восстановленных файлов на предмет целостности и отсутствия шифрования для дальнейшего криминалистического анализа",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Выполнена разработка методов для определения разделов диска и файловой системы, поиска наличия шифрования данных и дешифровки при условии известного пароля, включая:\n• определение разделов и ФС сырого образа диска мобильных телефонов;\n• поиск наличия шифрования разделов сырого образа диска мобильных телефонов;\n• дешифровка данных сырого образа диска мобильных телефонов при известном пароле;\n• определение разделов и ФС сырого образа диска SSD и HDD;\n• поиск наличия шифрования разделов сырого образа диска SSD и HDD."
        },
        {
            "num": "4",
            "activity": "Разработать методы извлечения информации из неисправных мобильных устройств, жестких дисков и твердотельных накопителей при условии физической целостности чипа",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Проведено исследование способов извлечения информации с HDD с учетом целостности магнитного носителя и без шифрования ОС. Отчет НИР написан.\nПроведено исследование способов извлечения информации с SSD с учетом целостности чипов NAND-контроллера и памяти и без шифрования ОС. Отчет НИР написан."
        },
        {
            "num": "5",
            "activity": "Разработка метода сортировки данных по типам и расположение по папкам (фото, видео, аудио, документы, контакты, геолокация, история чатов, история загрузок)",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Выполнен анализ отечественных и зарубежных решений по сортировке данных по типам и папкам.\nРазработан метод сортировки с ИИ и метод автоматической группировки по папкам с учётом особенностей файлов."
        },
        {
            "num": "6",
            "activity": "Методы анализа по поиску схожести в разных устройствах",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Разработан метод анализа типов файлов по заголовку и содержимому, а также данных SIM-карты.\nРазработан метод распознавания образов и идентификации голосов в медиафайлах, их сопоставления и поиска сходства."
        },
        {
            "num": "7",
            "activity": "Модули анализа: запрос (в зависимости от формата)",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Разработаны методы поиска по ключевым критериям в разных форматах:\n1. распознавание текста, объектов, лиц на фото;\n2. поиск по изображению;\n3. транскрибация речи, поиск по ключевым словам, идентификация по голосу;\n4. поиск по контактам;\n5. построение траектории передвижения;\n6. сортировка и фильтрация переписки, поиск похожих изображений;\n7. поиск ссылок и названия, определение группы."
        },
        {
            "num": "8",
            "activity": "Автоматическая генерация отчета – ПО модуль",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Разработан ПО-модуль, автоматически генерирующий текстовый отчет с результатами всех модулей АПК."
        },
        {
            "num": "9",
            "activity": "Разработка модуля ПО по определению уникальной хеш-суммы документа",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Разработан ПО-модуль для определения уникальной хеш-суммы файла."
        },
        {
            "num": "10",
            "activity": "Разработка двух видов аппаратного комплекса",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Проведен анализ аналогов, согласованы технические и физические свойства АПК, закуплено оборудование."
        },
        {
            "num": "11",
            "activity": "Архитектура ПО",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Спроектирована архитектура ПО согласно техзаданию и утверждена заказчиком."
        },
        {
            "num": "12",
            "activity": "Проведение CTF-соревнований",
            "dates": "1 сентября - 1 декабря 2024 года",
            "actual": "Соревнование CTF проведено 24 ноября 2024 года для студентов технических специальностей."
        },
        {
            "num": "13",
            "activity": "Разработка методов извлечения и восстановления данных из разных ФС",
            "dates": "5 января - 1 ноября 2025 года",
            "actual": "В процессе выполнения работ."
        },
        {
            "num": "14",
            "activity": "Разработка методов извлечения информации из неисправных устройств при целостности чипа",
            "dates": "5 января - 1 ноября 2025 года",
            "actual": "В процессе выполнения работ."
        },
        {
            "num": "15",
            "activity": "Разработка методов восстановления удаленных видеозаписей из ФС видеорегистраторов без перезаписи",
            "dates": "1 июня - 1 ноября 2025 года",
            "actual":"В процессе выполнения работ."
        },
        {
            "num": "16",
            "activity": "Методы анализа по поиску схожести в разных устройствах",
            "dates": "5 января - 1 ноября 2025 года",
            "actual": "В процессе выполнения работ."
        },
        {
            "num": "17",
            "activity": "Модули анализа: запрос (в зависимости от формата)",
            "dates": "5 января - 1 ноября 2025 года",
            "actual": "В процессе выполнения работ."
        },
        {
            "num": "18",
            "activity": "Разработка двух видов аппаратного комплекса",
            "dates": "5 января - сентябрь 2025 года",
            "actual": "В процессе выполнения работ."
        },
        {
            "num": "19",
            "activity": "Блок-схема исходного кода",
            "dates": "Ноябрь 2025 года",
            "actual": "В процессе выполнения работ."
        },
        {
            "num": "20",
            "activity": "Подготовка публикации",
            "dates": "Июль - 1 ноября 2025 года",
            "actual": "В процессе выполнения работ.\nОпубликованы 2 статьи:\n1) Rzayeva L. et al., «Разработка сервиса анализа переписок…», IJICT, 2025.\n2) Leila Rzayeva et al., «Analysis of technical features…», Scientific Journal of AITU.\nПриняты к публикации 4 статьи в журналах КОКНВО.\nПоданы 6 статей на международные конференции SNPD-2025, CSP2025, ISDFS 2025.\n5 статей коксон опубликованы\n5 статей скопус поданы, находятся на рецензировании\n9 статей международных конференций представлены, ожидается публикация"
        },
        {
            "num": "21",
            "activity": "Разработка пользовательского интерфейса по запросу заказчика",
            "dates": "Июль - 1 ноября 2025 года",
            "actual": "В процессе выполнения работ."
        },
        {
            "num": "22",
            "activity": "Проведение CTF-соревнований",
            "dates": "5 января - 1 ноября 2025 года",
            "actual": "Два мероприятия в рамках конференции ICCSDFAI25 на базе AITU 29–30 апреля 2025 года."
        }
    ],
    "table_conclusion": "Выводы: Соответствие проводимых мероприятий, степень достижения поставленных целей и задач, соответствие достигнутых результатов календарному плану и технической спецификации Договоров"
}